In [2]:
import pandas as pd 
import numpy as np

In [48]:
dados = pd.read_csv('census.csv')
dados.head()

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [84]:
dados2 = pd.DataFrame(dados.iloc[:, [3, -1]].values)
dados.shape

(32561, 15)

In [86]:
dados2.shape

(32561, 2)

In [90]:
dados2.head()

            0       1
0   Bachelors   <=50K
1   Bachelors   <=50K
2     HS-grad   <=50K
3        11th   <=50K
4   Bachelors   <=50K

In [108]:
agrupados = dados.groupby(['income', 'education']).size().reset_index(name='count')
agrupados_ordenados = agrupados.sort_values(by='education', ascending=False)
print(agrupados_ordenados)

    income      education  count
15   <=50K   Some-college   5904
30    >50K   Some-college   1387
29    >50K    Prof-school    423
14   <=50K    Prof-school    153
13   <=50K      Preschool     51
12   <=50K        Masters    764
28    >50K        Masters    959
11   <=50K        HS-grad   8826
27    >50K        HS-grad   1675
10   <=50K      Doctorate    107
26    >50K      Doctorate    306
9    <=50K      Bachelors   3134
25    >50K      Bachelors   2221
24    >50K      Assoc-voc    361
8    <=50K      Assoc-voc   1021
23    >50K     Assoc-acdm    265
7    <=50K     Assoc-acdm    802
22    >50K            9th     27
6    <=50K            9th    487
5    <=50K        7th-8th    606
21    >50K        7th-8th     40
4    <=50K        5th-6th    317
20    >50K        5th-6th     16
19    >50K        1st-4th      6
3    <=50K        1st-4th    162
2    <=50K           12th    400
18    >50K           12th     33
17    >50K           11th     60
1    <=50K           11th   1115
16    >50K           10th     62
0    <=50K           10th    871

In [147]:
agrupados_ordenados[agrupados_ordenados['education'].str.strip() == 'Bachelors']

    income   education  count
9    <=50K   Bachelors   3134
25    >50K   Bachelors   2221

In [197]:
abaixo_porcentagem = 3134/(3134+2221) * 100
print(f"{abaixo_porcentagem:.0f}% recebem menos de 50.000")
acima_porcentagem = 2221/(3134+2221) * 100
print(f"{acima_porcentagem:.0f}% recebem mais de 50.000")

59% recebem menos de 50.000
41% recebem mais de 50.000